<?xml version="1.0" ?>
<net name="leaky_relu_act_stacked8" version="10">
	<layers>
		<layer id="0" name="input_2" type="Parameter" version="opset1">
			<data shape="1, 128" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="Func/PartitionedCall/input/_0:0,input_2:0">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="PartitionedCall/leaky_relu_act_stacked8/leaky_re_lu/LeakyRelu/weights39287" type="Const" version="opset1">
			<data element_type="f32" shape="1" offset="0" size="4"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="PartitionedCall/leaky_relu_act_stacked8/leaky_re_lu/LeakyRelu" type="PReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="PartitionedCall/leaky_relu_act_stacked8/leaky_re_lu/LeakyRelu:0">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="PartitionedCall/leaky_relu_act_stacked8/leaky_re_lu_1/LeakyRelu/weights55278" type="Const" version="opset1">
			<data element_type="f32" shape="1" offset="0" size="4"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="PartitionedCall/leaky_relu_act_stacked8/leaky_re_lu_1/LeakyRelu" type="PReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="PartitionedCall/leaky_relu_act_stacked8/leaky_re_lu_1/LeakyRelu:0">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="PartitionedCall/leaky_relu_act_stacked8/leaky_re_lu_2/LeakyRelu/weights35272" type="Const" version="opset1">
			<data element_type="f32" shape="1" offset="0" size="4"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="PartitionedCall/leaky_relu_act_stacked8/leaky_re_lu_2/LeakyRelu" type="PReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="PartitionedCall/leaky_relu_act_stacked8/leaky_re_lu_2/LeakyRelu:0">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="PartitionedCall/leaky_relu_act_stacked8/leaky_re_lu_3/LeakyRelu/weights31284" type="Const" version="opset1">
			<data element_type="f32" shape="1" offset="0" size="4"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="PartitionedCall/leaky_relu_act_stacked8/leaky_re_lu_3/LeakyRelu" type="PReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="PartitionedCall/leaky_relu_act_stacked8/leaky_re_lu_3/LeakyRelu:0">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="PartitionedCall/leaky_relu_act_stacked8/leaky_re_lu_4/LeakyRelu/weights59275" type="Const" version="opset1">
			<data element_type="f32" shape="1" offset="0" size="4"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="PartitionedCall/leaky_relu_act_stacked8/leaky_re_lu_4/LeakyRelu" type="PReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="PartitionedCall/leaky_relu_act_stacked8/leaky_re_lu_4/LeakyRelu:0">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="PartitionedCall/leaky_relu_act_stacked8/leaky_re_lu_5/LeakyRelu/weights51290" type="Const" version="opset1">
			<data element_type="f32" shape="1" offset="0" size="4"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="PartitionedCall/leaky_relu_act_stacked8/leaky_re_lu_5/LeakyRelu" type="PReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="PartitionedCall/leaky_relu_act_stacked8/leaky_re_lu_5/LeakyRelu:0">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="PartitionedCall/leaky_relu_act_stacked8/leaky_re_lu_6/LeakyRelu/weights47269" type="Const" version="opset1">
			<data element_type="f32" shape="1" offset="0" size="4"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="PartitionedCall/leaky_relu_act_stacked8/leaky_re_lu_6/LeakyRelu" type="PReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="PartitionedCall/leaky_relu_act_stacked8/leaky_re_lu_6/LeakyRelu:0">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="PartitionedCall/leaky_relu_act_stacked8/leaky_re_lu_7/LeakyRelu/weights43281" type="Const" version="opset1">
			<data element_type="f32" shape="1" offset="0" size="4"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="PartitionedCall/leaky_relu_act_stacked8/leaky_re_lu_7/LeakyRelu" type="PReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="Func/PartitionedCall/output/_1:0,Identity:0,PartitionedCall/Identity:0,PartitionedCall/leaky_relu_act_stacked8/leaky_re_lu_7/LeakyRelu:0">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="Func/PartitionedCall/output/_1:0" type="Result" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</input>
		</layer>
	</layers>
	<edges>
		<edge from-layer="0" from-port="0" to-layer="2" to-port="0"/>
		<edge from-layer="1" from-port="0" to-layer="2" to-port="1"/>
		<edge from-layer="2" from-port="2" to-layer="4" to-port="0"/>
		<edge from-layer="3" from-port="0" to-layer="4" to-port="1"/>
		<edge from-layer="4" from-port="2" to-layer="6" to-port="0"/>
		<edge from-layer="5" from-port="0" to-layer="6" to-port="1"/>
		<edge from-layer="6" from-port="2" to-layer="8" to-port="0"/>
		<edge from-layer="7" from-port="0" to-layer="8" to-port="1"/>
		<edge from-layer="8" from-port="2" to-layer="10" to-port="0"/>
		<edge from-layer="9" from-port="0" to-layer="10" to-port="1"/>
		<edge from-layer="10" from-port="2" to-layer="12" to-port="0"/>
		<edge from-layer="11" from-port="0" to-layer="12" to-port="1"/>
		<edge from-layer="12" from-port="2" to-layer="14" to-port="0"/>
		<edge from-layer="13" from-port="0" to-layer="14" to-port="1"/>
		<edge from-layer="14" from-port="2" to-layer="16" to-port="0"/>
		<edge from-layer="15" from-port="0" to-layer="16" to-port="1"/>
		<edge from-layer="16" from-port="2" to-layer="17" to-port="0"/>
	</edges>
	<meta_data>
		<MO_version value="2021.4.1-3926-14e67d86634-releases/2021/4"/>
		<cli_parameters>
			<caffe_parser_path value="DIR"/>
			<data_type value="FP16"/>
			<disable_nhwc_to_nchw value="False"/>
			<disable_omitting_optional value="False"/>
			<disable_resnet_optimization value="False"/>
			<disable_weights_compression value="False"/>
			<enable_concat_optimization value="False"/>
			<enable_flattening_nested_params value="False"/>
			<enable_ssd_gluoncv value="False"/>
			<extensions value="DIR"/>
			<framework value="tf"/>
			<freeze_placeholder_with_value value="{}"/>
			<generate_deprecated_IR_V7 value="False"/>
			<input_model_is_text value="True"/>
			<k value="DIR\CustomLayersMapping.xml"/>
			<keep_shape_ops value="True"/>
			<legacy_ir_generation value="False"/>
			<legacy_mxnet_model value="False"/>
			<log_level value="ERROR"/>
			<mean_scale_values value="{}"/>
			<mean_values value="()"/>
			<model_name value="leaky_relu_act_stacked8"/>
			<output_dir value="DIR"/>
			<placeholder_data_types value="{}"/>
			<progress value="True"/>
			<remove_memory value="False"/>
			<remove_output_softmax value="False"/>
			<reverse_input_channels value="False"/>
			<save_params_from_nd value="False"/>
			<saved_model_dir value="DIR"/>
			<scale_values value="()"/>
			<silent value="False"/>
			<static_shape value="False"/>
			<stream_output value="False"/>
			<transform value=""/>
			<unset unset_cli_parameters="batch, counts, disable_fusing, disable_gfusing, finegrain_fusing, input, input_checkpoint, input_meta_graph, input_model, input_proto, input_shape, input_symbol, mean_file, mean_file_offsets, move_to_preprocess, nd_prefix_name, output, placeholder_shapes, pretrained_model_name, saved_model_tags, scale, tensorboard_logdir, tensorflow_custom_layer_libraries, tensorflow_custom_operations_config_update, tensorflow_object_detection_api_pipeline_config, tensorflow_use_custom_operations_config, transformations_config"/>
		</cli_parameters>
	</meta_data>
</net>
