<?xml version="1.0" ?>
<net name="simple_conv2d_stacked8" version="10">
	<layers>
		<layer id="0" name="input_1" type="Parameter" version="opset1">
			<data shape="1, 3, 128, 128" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="Func/StatefulPartitionedCall/input/_0:0,input_1:0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="StatefulPartitionedCall/simple_conv2d_stacked8/conv2d/Conv2D/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f16" shape="12, 3, 3, 3" offset="0" size="648"/>
			<output>
				<port id="0" precision="FP16" names="StatefulPartitionedCall/simple_conv2d_stacked8/conv2d/Conv2D/ReadVariableOp:0">
					<dim>12</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="StatefulPartitionedCall/simple_conv2d_stacked8/conv2d/Conv2D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="valid"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>12</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="StatefulPartitionedCall/simple_conv2d_stacked8/conv2d/Conv2D:0">
					<dim>1</dim>
					<dim>12</dim>
					<dim>126</dim>
					<dim>126</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="StatefulPartitionedCall/simple_conv2d_stacked8/conv2d/BiasAdd/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f16" shape="1, 12, 1, 1" offset="648" size="24"/>
			<output>
				<port id="0" precision="FP16" names="StatefulPartitionedCall/simple_conv2d_stacked8/conv2d/BiasAdd/ReadVariableOp:0">
					<dim>1</dim>
					<dim>12</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="StatefulPartitionedCall/simple_conv2d_stacked8/conv2d/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>12</dim>
					<dim>126</dim>
					<dim>126</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>12</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="StatefulPartitionedCall/simple_conv2d_stacked8/conv2d/BiasAdd:0">
					<dim>1</dim>
					<dim>12</dim>
					<dim>126</dim>
					<dim>126</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="StatefulPartitionedCall/simple_conv2d_stacked8/conv2d_1/Conv2D/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f16" shape="12, 12, 3, 3" offset="672" size="2592"/>
			<output>
				<port id="0" precision="FP16" names="StatefulPartitionedCall/simple_conv2d_stacked8/conv2d_1/Conv2D/ReadVariableOp:0">
					<dim>12</dim>
					<dim>12</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="StatefulPartitionedCall/simple_conv2d_stacked8/conv2d_1/Conv2D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="valid"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>12</dim>
					<dim>126</dim>
					<dim>126</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>12</dim>
					<dim>12</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="StatefulPartitionedCall/simple_conv2d_stacked8/conv2d_1/Conv2D:0">
					<dim>1</dim>
					<dim>12</dim>
					<dim>124</dim>
					<dim>124</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="StatefulPartitionedCall/simple_conv2d_stacked8/conv2d_1/BiasAdd/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f16" shape="1, 12, 1, 1" offset="648" size="24"/>
			<output>
				<port id="0" precision="FP16" names="StatefulPartitionedCall/simple_conv2d_stacked8/conv2d_1/BiasAdd/ReadVariableOp:0">
					<dim>1</dim>
					<dim>12</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="StatefulPartitionedCall/simple_conv2d_stacked8/conv2d_1/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>12</dim>
					<dim>124</dim>
					<dim>124</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>12</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="StatefulPartitionedCall/simple_conv2d_stacked8/conv2d_1/BiasAdd:0">
					<dim>1</dim>
					<dim>12</dim>
					<dim>124</dim>
					<dim>124</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="StatefulPartitionedCall/simple_conv2d_stacked8/conv2d_2/Conv2D/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f16" shape="12, 12, 3, 3" offset="3264" size="2592"/>
			<output>
				<port id="0" precision="FP16" names="StatefulPartitionedCall/simple_conv2d_stacked8/conv2d_2/Conv2D/ReadVariableOp:0">
					<dim>12</dim>
					<dim>12</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="StatefulPartitionedCall/simple_conv2d_stacked8/conv2d_2/Conv2D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="valid"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>12</dim>
					<dim>124</dim>
					<dim>124</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>12</dim>
					<dim>12</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="StatefulPartitionedCall/simple_conv2d_stacked8/conv2d_2/Conv2D:0">
					<dim>1</dim>
					<dim>12</dim>
					<dim>122</dim>
					<dim>122</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="StatefulPartitionedCall/simple_conv2d_stacked8/conv2d_2/BiasAdd/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f16" shape="1, 12, 1, 1" offset="648" size="24"/>
			<output>
				<port id="0" precision="FP16" names="StatefulPartitionedCall/simple_conv2d_stacked8/conv2d_2/BiasAdd/ReadVariableOp:0">
					<dim>1</dim>
					<dim>12</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="StatefulPartitionedCall/simple_conv2d_stacked8/conv2d_2/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>12</dim>
					<dim>122</dim>
					<dim>122</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>12</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="StatefulPartitionedCall/simple_conv2d_stacked8/conv2d_2/BiasAdd:0">
					<dim>1</dim>
					<dim>12</dim>
					<dim>122</dim>
					<dim>122</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="StatefulPartitionedCall/simple_conv2d_stacked8/conv2d_3/Conv2D/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f16" shape="12, 12, 3, 3" offset="5856" size="2592"/>
			<output>
				<port id="0" precision="FP16" names="StatefulPartitionedCall/simple_conv2d_stacked8/conv2d_3/Conv2D/ReadVariableOp:0">
					<dim>12</dim>
					<dim>12</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="StatefulPartitionedCall/simple_conv2d_stacked8/conv2d_3/Conv2D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="valid"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>12</dim>
					<dim>122</dim>
					<dim>122</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>12</dim>
					<dim>12</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="StatefulPartitionedCall/simple_conv2d_stacked8/conv2d_3/Conv2D:0">
					<dim>1</dim>
					<dim>12</dim>
					<dim>120</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="StatefulPartitionedCall/simple_conv2d_stacked8/conv2d_3/BiasAdd/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f16" shape="1, 12, 1, 1" offset="648" size="24"/>
			<output>
				<port id="0" precision="FP16" names="StatefulPartitionedCall/simple_conv2d_stacked8/conv2d_3/BiasAdd/ReadVariableOp:0">
					<dim>1</dim>
					<dim>12</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="StatefulPartitionedCall/simple_conv2d_stacked8/conv2d_3/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>12</dim>
					<dim>120</dim>
					<dim>120</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>12</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="StatefulPartitionedCall/simple_conv2d_stacked8/conv2d_3/BiasAdd:0">
					<dim>1</dim>
					<dim>12</dim>
					<dim>120</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="StatefulPartitionedCall/simple_conv2d_stacked8/conv2d_4/Conv2D/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f16" shape="12, 12, 3, 3" offset="8448" size="2592"/>
			<output>
				<port id="0" precision="FP16" names="StatefulPartitionedCall/simple_conv2d_stacked8/conv2d_4/Conv2D/ReadVariableOp:0">
					<dim>12</dim>
					<dim>12</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="StatefulPartitionedCall/simple_conv2d_stacked8/conv2d_4/Conv2D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="valid"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>12</dim>
					<dim>120</dim>
					<dim>120</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>12</dim>
					<dim>12</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="StatefulPartitionedCall/simple_conv2d_stacked8/conv2d_4/Conv2D:0">
					<dim>1</dim>
					<dim>12</dim>
					<dim>118</dim>
					<dim>118</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="StatefulPartitionedCall/simple_conv2d_stacked8/conv2d_4/BiasAdd/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f16" shape="1, 12, 1, 1" offset="648" size="24"/>
			<output>
				<port id="0" precision="FP16" names="StatefulPartitionedCall/simple_conv2d_stacked8/conv2d_4/BiasAdd/ReadVariableOp:0">
					<dim>1</dim>
					<dim>12</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="StatefulPartitionedCall/simple_conv2d_stacked8/conv2d_4/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>12</dim>
					<dim>118</dim>
					<dim>118</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>12</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="StatefulPartitionedCall/simple_conv2d_stacked8/conv2d_4/BiasAdd:0">
					<dim>1</dim>
					<dim>12</dim>
					<dim>118</dim>
					<dim>118</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="StatefulPartitionedCall/simple_conv2d_stacked8/conv2d_5/Conv2D/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f16" shape="12, 12, 3, 3" offset="11040" size="2592"/>
			<output>
				<port id="0" precision="FP16" names="StatefulPartitionedCall/simple_conv2d_stacked8/conv2d_5/Conv2D/ReadVariableOp:0">
					<dim>12</dim>
					<dim>12</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="StatefulPartitionedCall/simple_conv2d_stacked8/conv2d_5/Conv2D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="valid"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>12</dim>
					<dim>118</dim>
					<dim>118</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>12</dim>
					<dim>12</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="StatefulPartitionedCall/simple_conv2d_stacked8/conv2d_5/Conv2D:0">
					<dim>1</dim>
					<dim>12</dim>
					<dim>116</dim>
					<dim>116</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="StatefulPartitionedCall/simple_conv2d_stacked8/conv2d_5/BiasAdd/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f16" shape="1, 12, 1, 1" offset="648" size="24"/>
			<output>
				<port id="0" precision="FP16" names="StatefulPartitionedCall/simple_conv2d_stacked8/conv2d_5/BiasAdd/ReadVariableOp:0">
					<dim>1</dim>
					<dim>12</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="StatefulPartitionedCall/simple_conv2d_stacked8/conv2d_5/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>12</dim>
					<dim>116</dim>
					<dim>116</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>12</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="StatefulPartitionedCall/simple_conv2d_stacked8/conv2d_5/BiasAdd:0">
					<dim>1</dim>
					<dim>12</dim>
					<dim>116</dim>
					<dim>116</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="StatefulPartitionedCall/simple_conv2d_stacked8/conv2d_6/Conv2D/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f16" shape="12, 12, 3, 3" offset="13632" size="2592"/>
			<output>
				<port id="0" precision="FP16" names="StatefulPartitionedCall/simple_conv2d_stacked8/conv2d_6/Conv2D/ReadVariableOp:0">
					<dim>12</dim>
					<dim>12</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="StatefulPartitionedCall/simple_conv2d_stacked8/conv2d_6/Conv2D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="valid"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>12</dim>
					<dim>116</dim>
					<dim>116</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>12</dim>
					<dim>12</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="StatefulPartitionedCall/simple_conv2d_stacked8/conv2d_6/Conv2D:0">
					<dim>1</dim>
					<dim>12</dim>
					<dim>114</dim>
					<dim>114</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="StatefulPartitionedCall/simple_conv2d_stacked8/conv2d_6/BiasAdd/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f16" shape="1, 12, 1, 1" offset="648" size="24"/>
			<output>
				<port id="0" precision="FP16" names="StatefulPartitionedCall/simple_conv2d_stacked8/conv2d_6/BiasAdd/ReadVariableOp:0">
					<dim>1</dim>
					<dim>12</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="StatefulPartitionedCall/simple_conv2d_stacked8/conv2d_6/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>12</dim>
					<dim>114</dim>
					<dim>114</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>12</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="StatefulPartitionedCall/simple_conv2d_stacked8/conv2d_6/BiasAdd:0">
					<dim>1</dim>
					<dim>12</dim>
					<dim>114</dim>
					<dim>114</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="StatefulPartitionedCall/simple_conv2d_stacked8/conv2d_7/Conv2D/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f16" shape="12, 12, 3, 3" offset="16224" size="2592"/>
			<output>
				<port id="0" precision="FP16" names="StatefulPartitionedCall/simple_conv2d_stacked8/conv2d_7/Conv2D/ReadVariableOp:0">
					<dim>12</dim>
					<dim>12</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="StatefulPartitionedCall/simple_conv2d_stacked8/conv2d_7/Conv2D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="valid"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>12</dim>
					<dim>114</dim>
					<dim>114</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>12</dim>
					<dim>12</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="StatefulPartitionedCall/simple_conv2d_stacked8/conv2d_7/Conv2D:0">
					<dim>1</dim>
					<dim>12</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="StatefulPartitionedCall/simple_conv2d_stacked8/conv2d_7/BiasAdd/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f16" shape="1, 12, 1, 1" offset="648" size="24"/>
			<output>
				<port id="0" precision="FP16" names="StatefulPartitionedCall/simple_conv2d_stacked8/conv2d_7/BiasAdd/ReadVariableOp:0">
					<dim>1</dim>
					<dim>12</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="StatefulPartitionedCall/simple_conv2d_stacked8/conv2d_7/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>12</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>12</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="Func/StatefulPartitionedCall/output/_17:0,Identity:0,StatefulPartitionedCall/Identity:0,StatefulPartitionedCall/simple_conv2d_stacked8/conv2d_7/BiasAdd:0">
					<dim>1</dim>
					<dim>12</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="Func/StatefulPartitionedCall/output/_17:0" type="Result" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>12</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</input>
		</layer>
	</layers>
	<edges>
		<edge from-layer="0" from-port="0" to-layer="2" to-port="0"/>
		<edge from-layer="1" from-port="0" to-layer="2" to-port="1"/>
		<edge from-layer="2" from-port="2" to-layer="4" to-port="0"/>
		<edge from-layer="3" from-port="0" to-layer="4" to-port="1"/>
		<edge from-layer="4" from-port="2" to-layer="6" to-port="0"/>
		<edge from-layer="5" from-port="0" to-layer="6" to-port="1"/>
		<edge from-layer="6" from-port="2" to-layer="8" to-port="0"/>
		<edge from-layer="7" from-port="0" to-layer="8" to-port="1"/>
		<edge from-layer="8" from-port="2" to-layer="10" to-port="0"/>
		<edge from-layer="9" from-port="0" to-layer="10" to-port="1"/>
		<edge from-layer="10" from-port="2" to-layer="12" to-port="0"/>
		<edge from-layer="11" from-port="0" to-layer="12" to-port="1"/>
		<edge from-layer="12" from-port="2" to-layer="14" to-port="0"/>
		<edge from-layer="13" from-port="0" to-layer="14" to-port="1"/>
		<edge from-layer="14" from-port="2" to-layer="16" to-port="0"/>
		<edge from-layer="15" from-port="0" to-layer="16" to-port="1"/>
		<edge from-layer="16" from-port="2" to-layer="18" to-port="0"/>
		<edge from-layer="17" from-port="0" to-layer="18" to-port="1"/>
		<edge from-layer="18" from-port="2" to-layer="20" to-port="0"/>
		<edge from-layer="19" from-port="0" to-layer="20" to-port="1"/>
		<edge from-layer="20" from-port="2" to-layer="22" to-port="0"/>
		<edge from-layer="21" from-port="0" to-layer="22" to-port="1"/>
		<edge from-layer="22" from-port="2" to-layer="24" to-port="0"/>
		<edge from-layer="23" from-port="0" to-layer="24" to-port="1"/>
		<edge from-layer="24" from-port="2" to-layer="26" to-port="0"/>
		<edge from-layer="25" from-port="0" to-layer="26" to-port="1"/>
		<edge from-layer="26" from-port="2" to-layer="28" to-port="0"/>
		<edge from-layer="27" from-port="0" to-layer="28" to-port="1"/>
		<edge from-layer="28" from-port="2" to-layer="30" to-port="0"/>
		<edge from-layer="29" from-port="0" to-layer="30" to-port="1"/>
		<edge from-layer="30" from-port="2" to-layer="32" to-port="0"/>
		<edge from-layer="31" from-port="0" to-layer="32" to-port="1"/>
		<edge from-layer="32" from-port="2" to-layer="33" to-port="0"/>
	</edges>
	<meta_data>
		<MO_version value="2021.4.1-3926-14e67d86634-releases/2021/4"/>
		<cli_parameters>
			<caffe_parser_path value="DIR"/>
			<data_type value="FP16"/>
			<disable_nhwc_to_nchw value="False"/>
			<disable_omitting_optional value="False"/>
			<disable_resnet_optimization value="False"/>
			<disable_weights_compression value="False"/>
			<enable_concat_optimization value="False"/>
			<enable_flattening_nested_params value="False"/>
			<enable_ssd_gluoncv value="False"/>
			<extensions value="DIR"/>
			<framework value="tf"/>
			<freeze_placeholder_with_value value="{}"/>
			<generate_deprecated_IR_V7 value="False"/>
			<input_model_is_text value="True"/>
			<k value="DIR\CustomLayersMapping.xml"/>
			<keep_shape_ops value="True"/>
			<legacy_ir_generation value="False"/>
			<legacy_mxnet_model value="False"/>
			<log_level value="ERROR"/>
			<mean_scale_values value="{}"/>
			<mean_values value="()"/>
			<model_name value="simple_conv2d_stacked8"/>
			<output_dir value="DIR"/>
			<placeholder_data_types value="{}"/>
			<progress value="True"/>
			<remove_memory value="False"/>
			<remove_output_softmax value="False"/>
			<reverse_input_channels value="False"/>
			<save_params_from_nd value="False"/>
			<saved_model_dir value="DIR"/>
			<scale_values value="()"/>
			<silent value="False"/>
			<static_shape value="False"/>
			<stream_output value="False"/>
			<transform value=""/>
			<unset unset_cli_parameters="batch, counts, disable_fusing, disable_gfusing, finegrain_fusing, input, input_checkpoint, input_meta_graph, input_model, input_proto, input_shape, input_symbol, mean_file, mean_file_offsets, move_to_preprocess, nd_prefix_name, output, placeholder_shapes, pretrained_model_name, saved_model_tags, scale, tensorboard_logdir, tensorflow_custom_layer_libraries, tensorflow_custom_operations_config_update, tensorflow_object_detection_api_pipeline_config, tensorflow_use_custom_operations_config, transformations_config"/>
		</cli_parameters>
	</meta_data>
</net>
